<a href="https://colab.research.google.com/github/anatolii-kandiuk/research_students_df/blob/main/research_df.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [5]:
import pandas as pd
import numpy as np

In [6]:
df = pd.read_csv('sample_data/StudentsPerformance.csv')
print(df.iloc[0:7])

   gender race/ethnicity  ... reading score writing score
0  female        group B  ...            72            74
1  female        group C  ...            90            88
2  female        group B  ...            95            93
3    male        group A  ...            57            44
4    male        group C  ...            78            75
5  female        group B  ...            83            78
6  female        group B  ...            95            92

[7 rows x 8 columns]

In [7]:
df.shape

(1000, 8)

In [8]:
df.size

8000

In [9]:
(df['lunch'] != 'standard').mean()

0.355

In [10]:
df.dtypes

gender                         object
race/ethnicity                 object
parental level of education    object
lunch                          object
test preparation course        object
math score                      int64
reading score                   int64
writing score                   int64
dtype: object

In [11]:
df.loc[(df.lunch == 'standard'), ['reading score', 'math score', 'writing score']].mean()

reading score    71.654264
math score       70.034109
writing score    70.823256
dtype: float64

In [12]:
df.loc[(df.lunch != 'standard'), ['reading score', 'math score', 'writing score']].mean()

reading score    64.653521
math score       58.921127
writing score    63.022535
dtype: float64

In [13]:
df.loc[(df.lunch == 'standard'), ['reading score', 'math score', 'writing score']].var()

reading score    191.285560
math score       186.418089
writing score    205.620887
dtype: float64

In [14]:
df.loc[(df.lunch != 'standard'), ['reading score', 'math score', 'writing score']].var()

reading score    221.871139
math score       229.824270
writing score    238.202881
dtype: float64

In [15]:
df.head(1)

   gender race/ethnicity  ... reading score writing score
0  female        group B  ...            72            74

[1 rows x 8 columns]

In [16]:
df = df.rename(columns={
    'gender':'gender',
    'race/ethnicity':'race_ethnicity',
    'parental level of education':'parental_level_of_education',
    'lunch':'lunch',
    'test preparation course':'test_preparation_course',
    'math score':'math_score',
    'reading score':'reading_score',
    'writing score':'writing_score'    

})
df

     gender race_ethnicity  ... reading_score writing_score
0    female        group B  ...            72            74
1    female        group C  ...            90            88
2    female        group B  ...            95            93
3      male        group A  ...            57            44
4      male        group C  ...            78            75
..      ...            ...  ...           ...           ...
995  female        group E  ...            99            95
996    male        group C  ...            55            55
997  female        group C  ...            71            65
998  female        group D  ...            78            77
999  female        group D  ...            86            86

[1000 rows x 8 columns]

In [17]:
math_score_max = 100
df.query('math_score == @math_score_max')

     gender race_ethnicity  ... reading_score writing_score
149    male        group E  ...           100            93
451  female        group E  ...            92            97
458  female        group E  ...           100           100
623    male        group A  ...            96            86
625    male        group D  ...            97            99
916    male        group E  ...           100           100
962  female        group E  ...           100           100

[7 rows x 8 columns]

In [18]:
df.filter(like='score').head(1)

   math_score  reading_score  writing_score
0          72             72             74

In [19]:
acc_df = pd.read_csv('sample_data/accountancy.csv')
acc_df.tail()

    Unnamed: 0 Executor Type  Salary
45          45    Loopa    D     146
46          46    Loopa    A      58
47          47    Loopa    C      54
48          48     Pupa    F     142
49          49    Loopa    D     128

In [20]:
acc_df.describe()

       Unnamed: 0      Salary
count    50.00000   50.000000
mean     24.50000  145.140000
std      14.57738   61.373733
min       0.00000   50.000000
25%      12.25000   85.250000
50%      24.50000  146.000000
75%      36.75000  192.250000
max      49.00000  249.000000

In [28]:
acc_df.groupby(['Executor', 'Type']).aggregate({'Salary':'mean'})

                   Salary
Executor Type
Loopa    A      58.000000
         B     145.166667
         C     154.333333
         D     137.714286
         E     164.000000
         F     238.000000
Pupa     A     160.833333
         B      77.000000
         C      74.500000
         D     146.500000
         E     131.200000
         F     136.250000

In [29]:
dota2_df = pd.read_csv('sample_data/dota_hero_stats.csv')
dota2_df.tail()

     Unnamed: 0  ...                                              roles
112         112  ...       ['Carry', 'Escape', 'Disabler', 'Initiator']
113         113  ...         ['Support', 'Nuker', 'Disabler', 'Escape']
114         114  ...  ['Carry', 'Nuker', 'Disabler', 'Durable', 'Esc...
115         115  ...         ['Support', 'Nuker', 'Disabler', 'Escape']
116         116  ...      ['Carry', 'Initiator', 'Disabler', 'Durable']

[5 rows x 8 columns]

In [36]:
dota2_df.groupby(['attack_type', 'primary_attr']).nunique().id

attack_type  primary_attr
Melee        agi             19
             int              2
             str             35
Ranged       agi             18
             int             40
             str              3
Name: id, dtype: int64

In [37]:
algae_df = pd.read_csv('sample_data/algae.csv')
algae_df.tail()

                species        genus  group  ...   citrate   glucose  oleic_acid
5   Cladophora_compacta   Cladophora  green  ...  3.082826  3.343707    1.432514
6   Cladophora_gracilis   Cladophora  green  ...  5.841520  2.740165    2.829016
7      Palmaria_palmata     Palmaria    red  ...  5.573905  3.242090    2.245538
8  Saccharina_latissima   Saccharina  brown  ...  1.071920  3.947968    4.817804
9   Ascophyllum_nodosum  Ascophyllum  brown  ...  5.253527  3.414961    2.432526

[5 rows x 8 columns]

In [59]:
np.around(algae_df.query("genus=='Fucus'")
                  .alanin
                  .describe()
                  .loc[['min', 'max', 'mean']]
                  .values, decimals=2)

array([0.35, 6.64, 3.57])

In [60]:
algae_df.groupby('group').citrate.var()

group
brown    5.468942
green    3.950113
red           NaN
Name: citrate, dtype: float64

In [65]:
algae_df.groupby('group').species.nunique()

group
brown    6
green    3
red      1
Name: species, dtype: int64

In [81]:
algae_df.groupby('group').aggregate({'sucrose':lambda x:max(x)-min(x)})

        sucrose
group
brown  5.189345
green  3.259662
red    0.000000